import random

inventory = {0: '      /| ________________\n'
                'O|===|* >________________>\n'
                '      \|\n',
             1: '  |`-._/\_.-`|\n'
                '  |    ||    |\n'
                '  |___o()o___|\n'
                '  |__((<>))__|\n'
                '  \   o\/o   /\n'
                '   \   ||   /\n'
                '    \  ||  /\n'
                "     '.||.'\n",

             2: '     ______ ______\n'
                '   _/      Y      \_\n'
                '  // ~~ ~~ | ~~ ~  \\\\\n'
                ' // ~ ~ ~~ | ~~~ ~~ \\\\\n'
                '//________.|.________\\\\\n'    
                "'---------`-`---------'\n",

             3: '  ,:\      /:.\n'
                ' //  \_()_/  \\\\\n'
                '||   |    |   ||\n'
                '||   |    |   ||\n'
                '||   |____|   ||\n'
                ' \\\\  / || \  //\n'
                '  `:/  ||  \;\n'
                '       ||\n'
                '       ||\n'
                '       XX\n'
                '       XX\n'
                '       XX\n'
                '       XX\n'
                '       OO\n',
             4: '     *\n'
                '   *-|-*\n'
                '   ..*..\n'
                ' *"*****"*\n'
                '" """"""" "\n'
                '\*********/\n'
                '(((((0)))))\n'
             }

print('Перед долгой дорогой, тварец наградил вас своим даром:\n\n\n')
digit = random.randrange(5)
# захотел так, что уж тут поделать
print((inventory[digit]))
input('\n\nНажмите Enter, что бы выйти...')